# Pandas

# -Series

In [18]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [9]:
obj = pd.Series([5,4,3,2,1])

In [7]:
obj

0    5
1    4
2    3
3    2
4    1
dtype: int64

In [10]:
obj.values

array([5, 4, 3, 2, 1], dtype=int64)

In [11]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
obj2 = Series([4,5,-4.2,3],index=['a','b','c','d'])

In [15]:
obj2

a    4.0
b    5.0
c   -4.2
d    3.0
dtype: float64

In [21]:
sdata ={'ohio':35000,'Texas':71000,'oregon':16000,'utah':64000}

In [22]:
obj3 = Series(sdata)

In [23]:
obj3

ohio      35000
Texas     71000
oregon    16000
utah      64000
dtype: int64

In [31]:
obj3.name = 'population'
obj3.index.name = 'states'

In [32]:
obj3

states
ohio      35000
Texas     71000
oregon    16000
utah      64000
Name: population, dtype: int64

# DataFrame

In [33]:
data = {'State':['ohio','ohio','ohio','nevada','nevada'],
       'year':[2000,2001,2002,2001,2002],'pop':[1.2,1.7,3.6,2,9]}

In [34]:
df = DataFrame(data)

In [35]:
df

    State  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.0
4  nevada  2002  9.0

In [36]:
DataFrame(data,columns=['year','state','pop'])

   year state  pop
0  2000   NaN  1.2
1  2001   NaN  1.7
2  2002   NaN  3.6
3  2001   NaN  2.0
4  2002   NaN  9.0

In [37]:
data2 = {'nevada':{2001:2.5 , 2000:2.9},'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [38]:
df2 = DataFrame(data2)

In [39]:
df2

      nevada  ohio
2000     2.9   1.5
2001     2.5   1.7
2002     NaN   3.6

In [40]:
DataFrame(data2,index=[2001,2000,2003])

      nevada  ohio
2001     2.5   1.7
2000     2.9   1.5
2003     NaN   NaN

In [43]:
df2.index.name= 'year'
df2.columns.name = 'states'

In [44]:
df2

states  nevada  ohio
year
2000       2.9   1.5
2001       2.5   1.7
2002       NaN   3.6